<a href="https://colab.research.google.com/github/Muril88/AI-Fecap/blob/main/pr%C3%A9_processamento_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [11]:
dic = {"nome":["isa","Peter","x"],
       "idade":["19","28","0"],
       "salario":["19000","5000","100"],
       "genero":["F", "M", "honda4porta"],
       "cargo":["gerente", "supervisor",""]
    

}

In [12]:
df = pd.DataFrame(dic)
df

    nome idade salario       genero       cargo
0    isa    19   19000            F     gerente
1  Peter    28    5000            M  supervisor
2      x     0     100  honda4porta

In [13]:
print(df)

    nome idade salario       genero       cargo
0    isa    19   19000            F     gerente
1  Peter    28    5000            M  supervisor
2      x     0     100  honda4porta

In [14]:
df.info

<bound method DataFrame.info of     nome idade salario       genero       cargo
0    isa    19   19000            F     gerente
1  Peter    28    5000            M  supervisor
2      x     0     100  honda4porta            >

In [17]:
df = pd.get_dummies(df,columns=["genero"])

In [18]:
df

    nome idade salario       cargo  genero_F  genero_M  genero_honda4porta
0    isa    19   19000     gerente         1         0                   0
1  Peter    28    5000  supervisor         0         1                   0
2      x     0     100                     0         0                   1

In [19]:
df = df.drop(columns=["cargo"])

In [20]:
df

    nome idade salario  genero_F  genero_M  genero_honda4porta
0    isa    19   19000         1         0                   0
1  Peter    28    5000         0         1                   0
2      x     0     100         0         0                   1